<?php

return [
    'already_canceled' => 'Το πρωτόκολλο έχει ήδη ακυρωθεί!',
    'already_reactivated' => 'Το πρωτόκολλο έχει ήδη επανενεργοποιηθεί!',
    'success_cancel' => 'Το πρωτόκολλο ακυρώθηκε με επιτυχία!',
    'success_reactivation' => 'Το πρωτόκολλο επανενεργοποιήθηκε επιτυχώς!',
    'success_submission' => 'Το πρωτόκολλο υποβλήθηκε επιτυχώς!',
    'invalid_action' => 'Δόθηκε μη έγκυρη ενέργεια!',
    'error' => 'Σφάλμα!',
    'success' => 'Επιτυχία!',
    'submitting' => 'Υποβολή...',
    'delete_file_success' => 'Το αρχείο διαγράφηκε επιτυχώς!',
    'delete_file_error' => 'Το αρχείο δεν μπόρεσε να διαγραφεί.',
    'file_no_found' => 'Το αρχείο δεν βρέθηκε.',
    'file_save_error' => 'Προέκυψε κάποιο σφάλμα κατά την αποθήκευση του αρχείου: :file'
];
