<?php

return [
    'already_canceled' => 'Το πρωτόκολλο έχει ήδη ακυρωθεί!',
    'already_reactivated' => 'Το πρωτόκολλο έχει ήδη επανενεργοποιηθεί!',
    'success_cancel' => 'Το πρωτόκολλο ακυρώθηκε με επιτυχία!',
    'success_reactivation' => 'Το πρωτόκολλο επανενεργοποιήθηκε επιτυχώς!',
    'success_submission' => 'Το πρωτόκολλο υποβλήθηκε επιτυχώς!',
    'invalid_action' => 'Δόθηκε μη έγκυρη ενέργεια!',
    'error' => 'Σφάλμα!',
    'success' => 'Επιτυχία!',
    'submitting' => 'Υποβολή...',
    'delete_file_success' => 'Το αρχείο διαγράφηκε επιτυχώς!',
    'delete_file_error' => 'Το αρχείο δεν μπόρεσε να διαγραφεί.',
    'file_no_found' => 'Το αρχείο δεν βρέθηκε.',
    'file_save_error' => 'Προέκυψε κάποιο σφάλμα κατά την αποθήκευση του αρχείου: :file',
    'update_profile' => 'Ο χρήστης ενημέρωσε τα στοιχεία του προφίλ του',
    'password_update' => 'Ο χρήστης ενημέρωσε τον κωδικό πρόσβασης του λογαριασμού.',

    // Alerts
    'alert' => [
        'success' => [
            'account' => [
                'title' => 'Επιτυχής Ενημέρωση!',
                'content' => 'Τα στοιχεία του λογαριασμού ενημερώθηκαν με επιτυχία.'
            ],
            'password' => [
                'title' => 'Επιτυχής Ενημέρωση!',
                'content' => 'Ο κωδικός του λογαριασμού ενημερώθηκε με επιτυχία.'
            ],
            'protocol_create' => [
                'title' => 'Επιτυχής Δημιουργία!',
                'content' => 'Το πρωτόκολλο δημιουργήθηκε με επιτυχία.'
            ],
            'protocol_update' => [
                'title' => 'Επιτυχής Ενημέρωση!',
                'content' => 'Το πρωτόκολλο ενημερώθηκε με επιτυχία.'
            ]
        ],
        'failure' => [
            'account' => [
                'title' => 'Αποτυχία Ενημέρωσης!',
                'content' => 'Τα στοιχεία του λογαριασμού δεν έχουν ενημερωθεί.'
            ],
            'password' => [
                'title' => 'Αποτυχία Ενημέρωσης!',
                'content' => 'Ο κωδικός του λογαριασμού δεν έχει ενημερωθεί.'
            ],
            'protocol_create' => [
                'title' => 'Αποτυχία Δημιουργίας!',
                'content' => 'Το πρωτόκολλο δεν έχει δημιουργηθεί.'
            ],
            'protocol_update' => [
                'title' => 'Αποτυχία Ενημέρωσης!',
                'content' => 'Το πρωτόκολλο δεν ενημερώθηκε.'
            ]
        ]
    ]
];
